<?php
/*Есть строка $string = 'яблоко черешня вишня вишня черешня груша яблоко черешня вишня яблоко вишня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня черешня груша яблоко черешня вишня';
Подсчитайте, сколько раз каждый фрукт встречается в этой строке. Выведите  в виде списка в порядке уменьшения количества:
Пример вывода:
яблоко – 12
черешня – 8
груша – 5
слива - 3*/

$string = 'яблоко черешня вишня вишня черешня груша яблоко черешня вишня яблоко вишня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня черешня груша яблоко черешня вишня';
$fruits = explode(" ", $string); // повертає масив зі строки, розділення значень по пробілах
$uniqueCount = (array_count_values($fruits)); // рахує кількість повторів кожного значення в масиві
//$sorted = arsort($uniqueCount); // чомусь повертає "1", а не сортований масив. чому?
foreach($uniqueCount as $key => $item){
    echo "{$key} - {$item}<br>";
}
