<?php
/*Вам нужно разработать программу, которая считала бы сумму цифр числа введенного
пользователем. Например: есть число 123, то программа должна вычислить сумму цифр 1,
2, 3, т. е. 6.*/

/* В вашому коді значення $x надається без лапок, але в такому випадку не діє strlen($x).
Перевірка даних діє в обох випадках, але помилка (рядок 23) все одно з'являється.*/

$x = "3545365";

if(is_int($x) !== true){
    echo "Mistake";
}


$sum = 0;
for($i = 0; $i <= strlen($x); $i++) {
    $sum += $x[$i];
}

echo "$x<br>";
echo "$sum<br>";
// Notice: Uninitialized string offset: 5 in C:\xampp\htdocs\homeworks\arrays_loops_tasks\23.php on line 16

