<<<<<<< HEAD
<?php

/*Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if
выведите на экран столбец тех элементов массива, которые больше 3­х, но меньше 10.*/

$arr = array(2, 5, 9, 15, 0, 4);
foreach($arr as $item) {
    if (($item < 10 ) AND ($item > 3)) {
        echo $item . "<br>";
    }
}
=======
<?php

/*Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if
выведите на экран столбец тех элементов массива, которые больше 3­х, но меньше 10.*/

$arr = array(2, 5, 9, 15, 0, 4);
foreach($arr as $item) {
    if (($item < 10 ) AND ($item > 3)) {
        echo $item . "<br>";
    }
}
>>>>>>> 1937558703ec782ebdc56f6abe92c2a3b3d20042
