<<<<<<< HEAD
<?php

/*Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach создайте строку
'­1­2­3­4­5­6­7­8­9­'.*/

$arr = array(1, 2, 3, 4, 5, 6, 7, 8, 9);
foreach($arr as $key){
    echo "-{$key}";
}
echo "-";

=======
<?php

/*Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach создайте строку
'­1­2­3­4­5­6­7­8­9­'.*/

$arr = array(1, 2, 3, 4, 5, 6, 7, 8, 9);
foreach($arr as $key){
    echo "-{$key}";
}
echo "-";

>>>>>>> 1937558703ec782ebdc56f6abe92c2a3b3d20042
